Revit 2027 API
MEPAnalyticalConnectionType.IsNameUnused Method
 Checks if this is an unused name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNameUnused(
	Document doc,
	string name
)
Public Shared Function IsNameUnused (
	doc As Document,
	name As String
) As Boolean
public:
static bool IsNameUnused(
	Document^ doc,
	String^ name
)
static member IsNameUnused :
        doc : Document *
        name : string -> bool
Parameters
doc Document
 The document.
name String
 The name to be verified.
Return Value
Boolean
 True if not used by an existing analytical connection type in this document, false if used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace